RA3_DA3_50/0/porosity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    left
    {
		type		symmetry;
    }
    right
    {
		type		fixedValue;
		value		uniform 1;
    }
    top
    {
		type		fixedValue;
		value		uniform 1;
    }
    bottom
    {
		type		fixedValue;
		value		uniform 1;
    }
    front
	{
		type		symmetry;
	}
	back
	{
		type		fixedValue;
		value		uniform 1;
	}
	defaultFaces
	{
		type		empty;
	}
}


// ************************************************************************* //
